app/controllers/mp3s_controller.rb

SELECT * FROM "mp3s"
---
  def index
    @mp3s = Mp3.all

SELECT * FROM "mp3s" WHERE ("mp3s"."id" = 2)
---
  def show
    @mp3 = Mp3.find(params[:id])

SELECT * FROM "mp3s" WHERE ("mp3s"."id" = 2)
---
  def edit
    @mp3 = Mp3.find(params[:id])

INSERT INTO "mp3s" ("created_at", "title", "artist_name", "updated_at", "url", "length") VALUES('2010-07-19 13:55:57', 'Same Verse', 'Squeeze', '2010-07-19 13:55:57', 'track.mp3', 310)
---
  def create
    @mp3 = Mp3.new(params[:mp3])

    respond_to do |format|
      if @mp3.save

SELECT * FROM "mp3s" WHERE ("mp3s"."id" = 2)
UPDATE "mp3s" SET "updated_at" = '2010-07-19 16:20:09', "url" = 'http://russeguggemos.com/mp3s/listen.mp3' WHERE "id" = 2
---
  def update
    @mp3 = Mp3.find(params[:id])

    respond_to do |format|
      if @mp3.update_attributes(params[:mp3])

SELECT * FROM "mp3s" WHERE ("mp3s"."id" = 4)
---
  def new_rating

    @rating = Rating.new

    @mp3 = Mp3.find(params[:mp3_id])

SELECT avg("ratings".value) AS avg_value FROM "ratings" WHERE ("ratings".mp3_id = 4)
SELECT mp3s.url, mp3s.id, mp3s.artist_name, mp3s.title, mp3s.length, AVG(ratings.value) as avg_rating FROM "mp3s" INNER JOIN "ratings" ON ratings.mp3_id = mp3s.id WHERE (artist_name LIKE '%Go%') GROUP BY mp3s.id, url, artist_name, title, length HAVING AVG(ratings.value) >= 1 ORDER BY RANDOM()
---
  def random

      conditions = ["artist_name LIKE ?", "%#{params[:artist_name]}%"] unless params[:artist_name].nil?

      having = ["AVG(ratings.value) >= ?", Integer(params[:rating_min]) ] unless params[:rating_min].nil?

      sort = 'RANDOM()'

      select = 'mp3s.url, mp3s.id, mp3s.artist_name, mp3s.title, mp3s.length, AVG(ratings.value) as avg_rating'

    #SELECT url, artist_name, title, length, AVG(ratings.value) as avg_rating FROM "mp3s"
    #INNER JOIN "ratings" ON ratings.mp3_id = mp3s.id   GROUP BY url,artist_name, title, length  HAVING AVG(rtings.value) >= '1' ORDER BY RANDOM()


    @mp3s = Mp3.find :all, :order => 'RANDOM()',
                         :conditions => conditions,
                         :joins => :ratings,
                         :group => 'url,artist_name,title, length ',
                         :having => having,
                         :select => select